Диплом/src/DataProcessors/ИмпортЦенНоменклатуры/ИмпортЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИмпортЦенНоменклатуры</name>
</mdclass:DataProcessor>

Диплом/src/InformationRegisters/ЦеныЩитов/ЦеныЩитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныЩитов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Диплом/src/Catalogs/ДеревянныеЩиты_Номенклатура/ДеревянныеЩиты_Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДеревянныеЩиты_Номенклатура</name>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>EnumRef.Сорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипДеревянногоЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаВММ</name>
    <comment>Длина в миллиметрпах</comment>
    <type>
      <types>EnumRef.ДлинаЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаВММ</name>
    <comment>Ширина в мм щита</comment>
    <type>
      <types>EnumRef.ШиринаЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаВММ</name>
    <comment>Толщина щита в мм</comment>
    <type>
      <types>EnumRef.ТолщинаЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>МетрКвадратный</name>
    <comment>Метр квадратный</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетрКубический</name>
    <comment>Метр кубический</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицоСпецификации</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
        <types>CatalogRef.ЛесСырьё_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойМатериал</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Диплом/src/DataProcessors/ИмпортЦенНоменклатуры/ObjectModule.bsl
// присваем переменные
Перем кНоменклатура;
Перем кЦена; 
Перем кЭлемент;
Перем кЭлемент1;
Перем кЭлемент2;
Перем кЭлемент3;
Перем кЭлемент4;

Функция ЗаполнитьНаСервере(ТабДок, Данные, ТекДок) Экспорт 
	ТабДок1 = Новый ТабличныйДокумент;
	ЗаполнитьПеременныеМодуля(Данные);
	ЕстьОшибки        = Ложь;
	ПрерватьПриОшибке = Данные.ПрерватьПриОшибке;
	
	МакетН = ПолучитьМакет("МакетНазначения");
	Заголовок = МакетН.ПолучитьОбласть("Заголовок");
	СтрокаН = МакетН.ПолучитьОбласть("Строка");
	ТабДок1.Вывести(Заголовок);            
	
	
	Колво = 0;
	Для К = Данные.НомерПервойСтроки По Данные.НомерПоследнейСтроки Цикл
		
		тНоменклатура                = ЗначениеЯчейки(ТабДок, К, кНоменклатура);
		тЦена 				 = ЗначениеЯчейкиН(ТабДок, К, кЦена);
		
		СсылкаНоменклатура = НайтиНоменклатуру(тНоменклатура);
		
		Если СсылкаНоменклатура = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЦена = РегистрыСведений.ЦеныЩитов.СоздатьМенеджерЗаписи();
		НоваяЦена.Период = ТекущаяДата();
		НоваяЦена.Номенклатура = СсылкаНоменклатура;
		НоваяЦена.Цена = тЦена;
		
		НоваяЦена.Записать();
		
	КонецЦикла;    
	Возврат ТабДок1;
КонецФункции // ЗаполнитьНаСервере()

Функция ЗначениеЯчейки(ТабДок, Знач НомерСтроки, НомерКолонки)
	
	Если НомерКолонки = 0 Тогда
		Возврат "";
	КонецЕсли;
	НомерСтроки = Формат(НомерСтроки, "ЧГ=0");
	
	Возврат ТабДок.Область(НомерСтроки, НомерКолонки).Текст;
	
КонецФункции // ЗначениеЯчейки()

Функция ЗначениеЯчейкиН(ТабДок, Знач НомерСтроки, НомерКолонки)
	
	Если НомерКолонки = 0 Тогда
		Возврат "";
	КонецЕсли;
	НомерСтроки = Формат(НомерСтроки, "ЧГ=0");
	
	Возврат ТабДок.Область(НомерСтроки, 2).Текст;
	
КонецФункции // ЗначениеЯчейки()

Процедура ЗаполнитьПеременныеМодуля(Данные)
	
	кНоменклатура 	= Данные.Номенклатура;
	кЦена 	= Данные.Цена; 
	кЭлемент	= Данные.Элемент;
	кЭлемент1 	= Данные.Элемент1;
	кЭлемент2 	= Данные.Элемент2;
	кЭлемент3 	= Данные.Элемент3;
	кЭлемент4 	= Данные.Элемент4;
	
КонецПроцедуры

Функция НайтиНоменклатуру(ЗначениеПоля)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ДеревянныеЩиты_Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование", ЗначениеПоля);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
   		Возврат Неопределено;
		
	ИначеЕсли Результат.Количество() > 0 Тогда
		
		Возврат Результат[0].Ссылка;
	Иначе
		НоваяНоменклатура = Справочники.ДеревянныеЩиты_Номенклатура.СоздатьЭлемент();
		НоваяНоменклатура.Наименование = ЗначениеПоля;
		НоваяНоменклатура.Записать();
		
		Возврат НоваяНоменклатура;
	КонецЕсли;
	
КонецФункции
